title: Suspicious WMIC Usage
description: This rule detects suspicious usage of the Windows Management Instrumentation
  command-line tool (wmic.exe), which adversaries often leverage for discovery or
  lateral movement. The rule focuses on identifying wmic.exe process executions, along
  with specific command line parameters commonly associated with malicious activity.
author: Aytek Aytemur
date: 2025/05/16
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \wmic.exe
    CommandLine|contains:
    - process call create
    - ' /node:'
    - ' /format:'
  condition: selection
falsepositives:
- Legitimate use by system administrators for remote management
- Scheduled tasks leveraging WMIC for routine operations
level: high
status: experimental
