title: Suspicious PowerShell Script for Lateral Movement
description: Detects suspicious PowerShell commands commonly used for lateral movement,
  such as using WMI, WinRM, or creating new sessions on remote hosts. Attackers often
  leverage these commands to move laterally in a compromised environment.
author: Aytek Aytemur
date: 2025/05/16
sigma_rule:
  title: Suspicious PowerShell Script for Lateral Movement
  id: c5d7fbbf-85d3-4f24-bc7a-d3c10b363e12
  status: experimental
  description: Detects suspicious usage of PowerShell commands for lateral movement.
  references:
  - https://attack.mitre.org/techniques/T1021
  - https://attack.mitre.org/techniques/T1059/001
  logsource:
    category: process_creation
    product: windows
  detection:
    selection:
      CommandLine|contains:
      - Invoke-Command
      - Enter-PSSession
      - New-PSSession
      - Invoke-WmiMethod
      - Invoke-WMIMethod
      - Enable-PSRemoting
      - Set-Item WSMan:\localhost\Client\TrustedHosts
    condition: selection
  fields:
  - CommandLine
  - ParentCommandLine
  - Image
  - ParentImage
  - User
  tags:
  - attack.execution
  - attack.t1021
  - attack.t1059.001
  level: high
