title: Suspicious DLL Side-Loading via rundll32
description: Detects suspicious usage of rundll32 for side-loading DLL files from
  non-standard directories. Adversaries often leverage rundll32 to load malicious
  DLLs in order to evade security controls and execute code in an unexpected context.
author: Aytek Aytemur
date: 2025/05/28
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \rundll32.exe
    CommandLine|contains:
    - .dll
  condition: selection
fields:
- CommandLine
- Image
- ParentImage
falsepositives:
- Legitimate software updates or installers that load DLLs from custom paths
level: high
